Revit 2024 API
AssemblyMemberDifference Class
 Class that describes difference between two assembly members
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AssemblyMemberDifference : IDisposable
Visual Basic
Public Class AssemblyMemberDifference _
	Implements IDisposable
Visual C++
public ref class AssemblyMemberDifference : IDisposable
Remarks
 Different sub-classes of this class represent different kinds of differences between assembly members and contain additional data for each particular kind of difference.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AssemblyMemberDifference
 Autodesk.Revit.DB.AssemblyMemberDifferentCategory
 Autodesk.Revit.DB.AssemblyMemberDifferentGeometry
 Autodesk.Revit.DB.AssemblyMemberDifferentParameters
 Autodesk.Revit.DB.AssemblyMemberDifferentType
See Also
AssemblyMemberDifference Members
Autodesk.Revit.DB Namespace